---
kind: property
id: P:Autodesk.Revit.DB.Lighting.SpotLightDistribution.SpotBeamAngle
source: html/1850d0fb-4dc4-799c-b53a-6ac516d2f6b5.htm
---
# Autodesk.Revit.DB.Lighting.SpotLightDistribution.SpotBeamAngle Property

The spot beam angle.

## Syntax (C#)
```csharp
public double SpotBeamAngle { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The angle is not valid because it is not between 1.0e-2 and 160.0.